import { Novel } from "./type";

export const NOVEL_LIST: Novel[] = [
  {
    id: 1,
    image:
      "https://comicthumb-phinf.pstatic.net/20230427_30/pocket_1682567953252nPkOp_JPEG/gbabarians2.jpg?type=m260",
    title: "게임속 바바리안으로 살아남기",
    writer: "정윤강",
    recommendList: [
      {
        id: 1,
        nickname: "sunbi",
        recommend:
          "양이 부족하면 두번 읽어라. 그럼 양이 두배다. 아니면 머리에 문제가 있나?",
        time: "2021-07-23 00:19",
        like: 4863,
        hate: 24,
        commentList: [
          {
            id: 1,
            nickname: "랑아",
            comment: "천잰데?",
            time: "2021-07-23 00:39",
            like: 786,
            hate: 5,
          },
          {
            id: 2,
            nickname: "랑아2",
            comment: "천잰데2?",
            time: "2021-07-23 00:39",
            like: 786,
            hate: 5,
          },
          {
            id: 3,
            nickname: "랑아3",
            comment: "천잰데3?",
            time: "2021-07-23 00:39",
            like: 786,
            hate: 5,
          },
        ],
      },
      {
        id: 2,
        nickname: "정윤강",
        recommend:
          "안녕하세요 정윤강입니다.이전 회차에서 정수를 먹는 걸 두고 두 가지 버전의 원고를 작성했고, 거기서 하나를 택해 진행을 했는데 제가 착각을 하고 이번 회차 원고를 작성했습니다. 혼란을 드려 죄송하고 금일 내에 수정될 수 있도록 하겠습니다. 별개로 이렇게 공지로 남길 얘기는 아니라 생각하지만, 이렇게 실수까지 나온 마당에 말씀드리자면, 최근에 제가 글 외적으로 힘든 일이 많아서 정신이 너무 없었습니다. 지금 당장은 사정을 다 말씀드릴 수는 없지만 언젠가 완결 후기를 남길 때 웃으며 말씀드릴 수 있으면 좋겠네요. 어찌됐든 최대한 빨리 회복해서 이전과 같은 모습 보여드릴 수 있도록 해보겠습니다. 언제 또 댓글을 남기러 올지 모르지만, 독자님들께는 늘 감사하고 죄송한 마음 뿐입니다. 항상 감사하고 죄송합니다.",
        time: "2021-09-23 00:19",
        like: 4863,
        hate: 24,
        commentList: [
          {
            id: 4,
            nickname: "랑아",
            comment: "천잰데?",
            time: "2021-07-23 00:39",
            like: 786,
            hate: 5,
          },
          {
            id: 5,
            nickname: "랑아2",
            comment: "천잰데2?",
            time: "2021-07-23 00:39",
            like: 786,
            hate: 5,
          },
          {
            id: 6,
            nickname: "랑아3",
            comment: "천잰데3?",
            time: "2021-07-23 00:39",
            like: 786,
            hate: 5,
          },
        ],
      },
    ],
    recommendNovelList: [
      {
        id: 2,
        image:
          "https://comicthumb-phinf.pstatic.net/20240226_168/pocket_1708924474058LGdlO_JPEG/503591.jpg?type=m260",
        title: "아포칼립스에 집을 숨김",
        writer: "정윤강",
      },
      {
        id: 6,
        image:
          "https://comicthumb-phinf.pstatic.net/20240325_105/pocket_1711324984940TeArg_JPEG/%28%C3%D6%C1%BE%29_%C8%F7%BE%EE%B7%CE%B0%A1-%B5%B9%BE%C6%BF%D4%B4%D9.jpg?type=m260",
        title: "히어로가 돌아왔다",
        writer: "강히",
      },
    ],
  },
  {
    id: 2,
    image:
      "https://comicthumb-phinf.pstatic.net/20240226_168/pocket_1708924474058LGdlO_JPEG/503591.jpg?type=m260",
    title: "아포칼립스에 집을 숨김",
    writer: "정윤강",
    recommendList: [
      {
        id: 3,
        nickname: "두유",
        recommend:
          "🔥전설의 아포칼립스 명작 드디어 시리즈 상륙!🔥문피아 무료1위 유료1위 연속 알박, 독자 추천글 역대급 러쉬의 화제의 대작! ⭐ 1~11화 : 1화 1에피로 등장인물, 세계관 소개 ⭐ 12화 이후 : 서서히 주인공 중심으로 메인스토리 시작 🔥독창적 스토리, 입체적 캐릭터, 비장함, 감동, 유머까지 다 갖춘 아포칼립스 필독서! 해피엔딩 복선 있음! 안보면 인생손해! 🔥개인적인 추천 에피소드 : 캣맘, 재벌, 골드, 빛이 된 남자, 변신, 불멸, 메시아, 거목, 판결 (114화 연재 기준) *️⃣ 이 작가님의 다른 추천 작품 : 주인공이 자비를 숨김, 주인공이 힘을 숨김 (이분이 숨김제목 원조! 재밌으면 같이 읽어보세요!^.^)",
        time: "2023-04-17 22:19",
        like: 4863,
        hate: 24,
        commentList: [
          {
            id: 7,
            nickname: "랑아",
            comment: "천잰데?",
            time: "2021-07-23 00:39",
            like: 786,
            hate: 5,
          },
          {
            id: 8,
            nickname: "랑아2",
            comment: "천잰데2?",
            time: "2021-07-23 00:39",
            like: 786,
            hate: 5,
          },
          {
            id: 9,
            nickname: "랑아3",
            comment: "천잰데3?",
            time: "2021-07-23 00:39",
            like: 786,
            hate: 5,
          },
        ],
      },
      {
        id: 10,
        nickname: "sunbi",
        recommend:
          "양이 부족하면 두번 읽어라. 그럼 양이 두배다. 아니면 머리에 문제가 있나?",
        time: "2021-07-23 00:19",
        like: 4863,
        hate: 24,
        commentList: [
          {
            id: 11,
            nickname: "랑아",
            comment: "천잰데?",
            time: "2021-07-23 00:39",
            like: 786,
            hate: 5,
          },
          {
            id: 12,
            nickname: "랑아2",
            comment: "천잰데2?",
            time: "2021-07-23 00:39",
            like: 786,
            hate: 5,
          },
          {
            id: 13,
            nickname: "랑아3",
            comment: "천잰데3?",
            time: "2021-07-23 00:39",
            like: 786,
            hate: 5,
          },
        ],
      },
    ],
    recommendNovelList: [
      {
        id: 3,
        image:
          "https://comicthumb-phinf.pstatic.net/20230522_129/pocket_1684745007173F4l14_PNG/cover.png?type=m260",
        title: "전지적 독자 시점",
        writer: "싱송",
      },
    ],
  },
  {
    id: 3,
    image:
      "https://comicthumb-phinf.pstatic.net/20230522_129/pocket_1684745007173F4l14_PNG/cover.png?type=m260",
    title: "전지적 독자 시점",
    writer: "싱송",
    recommendList: [
      {
        id: 14,
        nickname: "anrz",
        recommend:
          "문득 든 생각인데 김독자가 멸살법을 처음부터 끝까지 다 봐버려서 지구가 이꼴 난 건 아닐까하네요. 초월적인 존재가 이루어질수 없는 불가능한 '이야기'를 만들었는데 그 더럽게 재미없는 '이야기'를 변태같은 김독자가 다 읽어서 '이야기'가 완성 된 것. 원래 이야기란 듣는 사람이 아무도 없다면 이야기가 아니니까요",
        time: "2018-05-31 21:47",
        like: 4863,
        hate: 24,
        commentList: [
          {
            id: 15,
            nickname: "랑아",
            comment: "천잰데?",
            time: "2021-07-23 00:39",
            like: 786,
            hate: 5,
          },
          {
            id: 16,
            nickname: "랑아2",
            comment: "천잰데2?",
            time: "2021-07-23 00:39",
            like: 786,
            hate: 5,
          },
          {
            id: 17,
            nickname: "랑아3",
            comment: "천잰데3?",
            time: "2021-07-23 00:39",
            like: 786,
            hate: 5,
          },
        ],
      },
      {
        id: 18,
        nickname: "sunbi",
        recommend:
          "양이 부족하면 두번 읽어라. 그럼 양이 두배다. 아니면 머리에 문제가 있나?",
        time: "2021-07-23 00:19",
        like: 4863,
        hate: 24,
        commentList: [
          {
            id: 19,
            nickname: "랑아",
            comment: "천잰데?",
            time: "2021-07-23 00:39",
            like: 786,
            hate: 5,
          },
          {
            id: 20,
            nickname: "랑아2",
            comment: "천잰데2?",
            time: "2021-07-23 00:39",
            like: 786,
            hate: 5,
          },
          {
            id: 21,
            nickname: "랑아3",
            comment: "천잰데3?",
            time: "2021-07-23 00:39",
            like: 786,
            hate: 5,
          },
        ],
      },
    ],
    recommendNovelList: [
      {
        id: 1,
        image:
          "https://comicthumb-phinf.pstatic.net/20230427_30/pocket_1682567953252nPkOp_JPEG/gbabarians2.jpg?type=m260",
        title: "게임속 바바리안으로 살아남기",
        writer: "정윤강",
      },
    ],
  },
];
